In [1]:
import pandas as pd
# Files to load
school_data_to_load = "schools_complete.csv"
student_data_to_load = "students_complete.csv"

# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [2]:
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
#student_data_df.isnull().sum()

In [4]:
# Determine if there are not any missing values in the school data.
#school_data_df.notnull()

In [5]:
# Determine if there are not any missing values in the school data.
#school_data_df.notnull().sum()

In [6]:
# Determine if there are not any missing values in the school data.
#student_data_df.notnull().sum()

In [7]:
# Determine data types for the school DataFrame.
#school_data_df.dtypes

In [8]:
#school_data_df["budget"].dtypes

In [9]:
#school_data_df.budget.dtype

In [10]:
#student_data_df.dtypes

In [11]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]
# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

In [12]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [13]:
# Get the total number of students.
student_count = school_data_complete_df["Student ID"].count()
#get total schools
school_count = school_data_df["school_name"].count()

In [14]:
#get the budget of the schools
sum_budget = sum(school_data_complete_df['budget'].unique())
sum_budget

24649428

In [15]:
read_avg = school_data_complete_df['reading_score'].mean()
math_avg = school_data_complete_df['math_score'].mean()

In [16]:
passers_read= []
for read_score in school_data_complete_df['reading_score']:
    if read_score > 69:
        passers_read.append(read_score)
passing_read_percentage = len(passers_read)/len(school_data_complete_df['reading_score'])
passing_read_percentage

0.8580546336482001

In [17]:
passers_math= []
for math_score in school_data_complete_df['math_score']:
    if math_score > 69:
        passers_math.append(math_score)
passing_math_percentage = len(passers_math)/len(school_data_complete_df['math_score'])
passing_math_percentage

0.749808526933878

In [18]:
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [19]:
# Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]

In [20]:
passing_math_count = passing_math['student_name'].count()
passing_math_pct = passing_math_count / float(student_count)*100
passing_math_pct

74.9808526933878

In [21]:
passing_reading_count = passing_reading['student_name'].count()
passing_reading_pct = passing_reading_count / student_count*100
passing_reading_pct

85.80546336482001

In [22]:
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]
passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [23]:
double_pass = passing_math_reading['student_name'].count()

In [24]:
double_pass

25528

In [25]:
double_pass_pct = double_pass/student_count*100

In [26]:
district_summary_df = pd.DataFrame([{'Total Schools':school_count,
                                    'total students':student_count,
                                    'total budget':sum_budget,
                                    'Average Math Score':math_avg,
                                    'Average Reading Score':read_avg,
                                    '% Passing Math':passing_math_pct,
                                    '% Passing Reading':passing_reading_pct,
                                    '% Overall Passing':double_pass_pct}])

In [27]:
district_summary_df

,Total Schools,total students,total budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [28]:
# Using the format() function.
my_grades = [92.34, 84.56, 86.78, 98.32]

for grade in my_grades:
    print("{:.0f}".format(grade))

92
85
87
98

In [29]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["total students"] = district_summary_df["total students"].map("{:,}".format)

district_summary_df["total students"]

0    39,170
Name: total students, dtype: object

In [30]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["total budget"] = district_summary_df["total budget"].map("${:,.2f}".format)

district_summary_df["total budget"]

0    $24,649,428.00
Name: total budget, dtype: object

In [31]:
# Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [32]:
district_summary_df

,Total Schools,total students,total budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [34]:
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "total students", "total budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,total students,total budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65